#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	СформироватьДвиженияДополнительныеНачисления();

	СформироватьДвиженияУдержания();

	ДвиженияВзаиморасчетыССотрудниками();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияДополнительныеНачисления()

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;

	Для Каждого Строка Из СписокСотрудников Цикл

		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.БазовыйПериодНачало = НачалоМесяца(ПериодРегистрации);
		Движение.БазовыйПериодКонец = КонецМесяца(ПериодРегистрации);
		Движение.Результат = Строка.СуммаПремии;

	КонецЦикла;

	Движения.ВКМ_ДополнительныеНачисления.Записать();
КонецПроцедуры

Процедура СформироватьДвиженияУдержания()	
	
	Движения.ВКМ_Удержания.Записывать = Истина;

	Для Каждого Строка Из СписокСотрудников Цикл

		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.БазовыйПериодНачало = НачалоМесяца(ПериодРегистрации);
		Движение.БазовыйПериодКонец = КонецМесяца(ПериодРегистрации);
		// Расчет НДФЛ (13%)
		Движение.Результат = Окр(Строка.СуммаПремии * 0.13, 0);

	КонецЦикла;

	Движения.ВКМ_Удержания.Записать();
КонецПроцедуры

Процедура ДвиженияВзаиморасчетыССотрудниками() 
	
	// регистр ВзаиморасчетыССотрудниками
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	СписокСотрудников.Сотрудник КАК Сотрудник,
				   |	СУММА(СписокСотрудников.СуммаПремии) КАК СуммаПремии
				   |ИЗ
				   |	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК СписокСотрудников
				   |ГДЕ
				   |	СписокСотрудников.Ссылка = &Ссылка
				   |СГРУППИРОВАТЬ ПО
				   |	СписокСотрудников.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Пока РезультатЗапроса.Следующий() Цикл

		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = РезультатЗапроса.Сотрудник;	
		// Оптимизированный расчет суммы "на руки" (87%)
		Движение.Сумма = Окр(РезультатЗапроса.СуммаПремии * 0.87, 2);

	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#КонецЕсли